In [23]:
import pandas as pd
import numpy as np

data={"eng":[10,30,50,70],"kor":[20,40,60,80],"math":[90,50,20,70]}
df=pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [2]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [3]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [4]:
df['eng']=2

In [6]:
df['eng']=[1,2,3,4]

In [8]:
df['eng']=df['eng']+2

In [12]:
df.loc['b']=2

In [14]:
df.loc['b']=[1,2,3]

In [15]:
df

   eng  kor  math
a    3   20    90
b    1    2     3
c    5   60    20
d    6   80    70

In [16]:
df.loc['b']=df.loc['b']+2

In [17]:
df

   eng  kor  math
a    3   20    90
b    3    4     5
c    5   60    20
d    6   80    70

In [19]:
df.loc["c":,"kor":]=[[1,2],[3,4]]

In [21]:
df.loc["c":,"kor":]=df.loc["c":,"kor":]+2

In [22]:
df

   eng  kor  math
a    3   20    90
b    3    4     5
c    5    3     4
d    6    5     6

In [24]:
#행단위 boolean indexing
df[[True,False,True,True]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [25]:
df['eng']>=30

a    False
b     True
c     True
d     True
Name: eng, dtype: bool

In [28]:
df[df['eng']>30]

c    50
d    70
Name: eng, dtype: int64

In [30]:
df[(df['kor']==40) | (df['kor']==80)]

   eng  kor  math
b   30   40    50
d   70   80    70

In [32]:
df.query('eng>30')
#df[df['eng']>30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [34]:
df.query('kor==40 | kor==80')
#df[(df['kor']==40) | (df['kor']==80)]

   eng  kor  math
b   30   40    50
d   70   80    70

In [37]:
n=30
df.query(f'eng>{n}')

   eng  kor  math
c   50   60    20
d   70   80    70